{
 "Prompt Engineering for Product Managers (BASIC)":  ["# Problem: Structured Data Extraction from Transcriptions\n\n## Customer Context\nABC uses our voicebot to handle inbound calls from buyers. Many of these calls contain unstructured, free-flow speech — buyers mix Hindi, English, and Hinglish, speak fast, skip details, or change their mind mid-call.\n\n---\n\n## Sample Transcript 1 – Simple Confirmation\n**Agent:** Namaste ji, aap 200 plywood sheets, 12mm, Pune delivery confirm karte hain?  \n**Buyer:** Haan confirm kar dijiye.  \n**Agent:** Delivery next week theek rahega?  \n**Buyer:** Haan.\n\n---\n\n## Sample Transcript 2 – Address Update\n**Agent:** Delivery address confirm kar lu?  \n**Buyer:** Nahi, address change hai. Gali no 3, Geeta Colony, Delhi.  \n**Agent:** PIN code, please?  \n**Buyer:** 110031.  \n**Agent:** Delivery kal ya parso?  \n**Buyer:** Parso.\n\n---\n\n## Sample Transcript 3 – Free-form Requirement\n**Buyer:** Mujhe 10kg iron rod chahiye, 12mm ka.  \n**Agent:** Quantity confirm kar du — 10 kilogram rods, 12 millimetre?  \n**Buyer:** Haan.\n\n---\n\n## Sample Transcript 4 – Simple Confirmation\n**Agent:** Namaste ji, aap 200 plywood sheets, 12mm, Pune delivery confirm karte hain?  \n**Buyer:** aap kaun?  \n**Agent:** Me ABC se apki virtual assistant baat kr rahi hu, aap Nilesh Ji hai na?  \n**Buyer:** ABC kaun?  \n**Agent:** ABC ek B2B marketplace hai, aapne waha interest show kia tha Plywood ke liye?  \n**Buyer:** Haan Haan Bataiye.  \n**Agent:** Kya aap interest confirm karte hai 200 plywood sheets ka?  \n**Buyer:** Yes sure!  \n**Agent:** Delivery next week theek rahega?  \n**Buyer:** Haan.\n\n---\n\n# Questions\nThe client wants structured outputs from these calls to feed into their CRM.\n\n**a) What data do you think we should extract from here?**  \n**b) How would you go about extracting it?**"],
    "AI Literacy for Leaders (INTERMEDIATE)": [
      "You are given a GitHub repo containing an LLM prompt-flow for an internal assistant used by business teams. The flow has multiple prompt files and a config.json. Review the repo structure, identify flaws causing inconsistent outputs, and propose a corrected flow. Demonstrate 1–2 improved outputs using the updated prompts.",
      
      "You are given a small dataset (CSV) of LLM outputs from a sales-recommendation feature, along with eval labels like 'unsafe', 'irrelevant', 'high latency'. Analyze the dataset, identify patterns of unsafe or unreliable behavior, and prepare a concise remediation plan summarizable to the CPTO.",
      
      "A database table contains logs of a 3-step AI workflow (classification → enrichment → summarization) including token usage, latency, and error messages. Query the table to identify bottlenecks and propose optimizations like step merging, caching, or prompt tightening. Present your findings in a simple, CPTO-ready summary.",
      
      "You’re provided a PDF document containing anonymized customer prompts and the LLM’s biased responses. Review the document, highlight sources of bias, redesign the system prompt or guardrails to mitigate the issue, and write a brief note explaining a scalable organizational fairness strategy for leadership.",
      
      "You are given a dataset of A/B test results for two AI features (metrics: latency, cost per request, accuracy, satisfaction score). Clean the dataset, compute key comparisons, and restructure the results into a clear executive-level dashboard narrative the CPTO can immediately act upon."
    ]

}
